## Dependencies

In [21]:
import pandas as pd
import numpy as np
import scipy as sp
import os

## Data Set

In [22]:
raw_dataset_path = '../dataset/raw/'
processed_dataset_path = '../dataset/processed/'
raw_dataset_file = 'Capstone_Dataset_v1.0.csv'
processed_dataset_file = 'Processed_Capstone_Dataset_v1.0.csv'

In [24]:
raw_dataset_full_path = os.path.join(raw_dataset_path, raw_dataset_file)
df = pd.read_csv(raw_dataset_full_path)
print(f"Raw dataset '{raw_dataset_file}' loaded successfully from {raw_dataset_path}")
df.info()

Raw dataset 'Capstone_Dataset_v1.0.csv' loaded successfully from ../dataset/raw/
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71357 entries, 0 to 71356
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          71357 non-null  object
 1   DEPARTMENT  71357 non-null  object
 2   CATEGORY    71357 non-null  object
 3   SKU         71357 non-null  object
 4   Store       71357 non-null  object
 5   Week        71357 non-null  object
 6   Units_Sold  71357 non-null  int64
 7   Net_Price   71357 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 4.4+ MB

In [26]:
df.head()

,ID,DEPARTMENT,CATEGORY,SKU,Store,Week,Units_Sold,Net_Price
0,Store_6_SKU238,Dept13,Category34,SKU238,Store_6,3/31/2021,625,2.04
1,Store_18_SKU329,Dept18,Category42,SKU329,Store_18,3/31/2021,209,26.73
2,Store_3_SKU76,Dept5,Category24,SKU76,Store_3,3/31/2021,2146,21.72
3,Store_16_SKU18,Dept17,Category70,SKU18,Store_16,3/31/2021,317,2.64
4,Store_5_SKU719,Dept43,Category12,SKU719,Store_5,3/31/2021,97,23.82

ID: Identifies each product sold in a specific store.
DEPARTMENT: The department to which the product belongs.
CATEGORY: The category of the product.
SKU: Stock-keeping unit, a unique identifier for each product.
Store: The store where the sales occurred.
Week: The date when sales occurred (weekly).
Units_Sold: Number of units sold.
Net_Price: Net price of the sold product.

## Cleansing and Wrangling

In [27]:
df['Week'] = pd.to_datetime(df['Week'], format='%m/%d/%Y')
df.head()

,ID,DEPARTMENT,CATEGORY,SKU,Store,Week,Units_Sold,Net_Price
0,Store_6_SKU238,Dept13,Category34,SKU238,Store_6,2021-03-31,625,2.04
1,Store_18_SKU329,Dept18,Category42,SKU329,Store_18,2021-03-31,209,26.73
2,Store_3_SKU76,Dept5,Category24,SKU76,Store_3,2021-03-31,2146,21.72
3,Store_16_SKU18,Dept17,Category70,SKU18,Store_16,2021-03-31,317,2.64
4,Store_5_SKU719,Dept43,Category12,SKU719,Store_5,2021-03-31,97,23.82

In [28]:
missing_values = df.isnull().sum()
print("Missing values in the dataset before cleaning:")
print(missing_values)

Missing values in the dataset before cleaning:
ID            0
DEPARTMENT    0
CATEGORY      0
SKU           0
Store         0
Week          0
Units_Sold    0
Net_Price     0
dtype: int64

In [29]:
df.drop_duplicates(inplace=True)

In [30]:
# Feature 1: Total Revenue (Units_Sold * Net_Price)
df['Total_Revenue'] = df['Units_Sold'] * df['Net_Price']

In [35]:
df['Net_Price'] = df['Net_Price'].round(2)
df['Total_Revenue'] = df['Total_Revenue'].round(2)

In [31]:
# Feature 2: Extract time-based features from 'Week'
df['Year'] = df['Week'].dt.year
df['Month'] = df['Week'].dt.month
df['Week_Number'] = df['Week'].dt.isocalendar().week

In [36]:
df_cleaned_head = df.head()
df_cleaned_info = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71357 entries, 0 to 71356
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             71357 non-null  object
 1   DEPARTMENT     71357 non-null  object
 2   CATEGORY       71357 non-null  object
 3   SKU            71357 non-null  object
 4   Store          71357 non-null  object
 5   Week           71357 non-null  datetime64[ns]
 6   Units_Sold     71357 non-null  int64
 7   Net_Price      71357 non-null  float64
 8   Total_Revenue  71357 non-null  float64
 9   Year           71357 non-null  int32
 10  Month          71357 non-null  int32
 11  Week_Number    71357 non-null  UInt32
dtypes: UInt32(1), datetime64[ns](1), float64(2), int32(2), int64(1), object(5)
memory usage: 5.8+ MB

In [37]:
df_cleaned_head

,ID,DEPARTMENT,CATEGORY,SKU,Store,Week,Units_Sold,Net_Price,Total_Revenue,Year,Month,Week_Number
0,Store_6_SKU238,Dept13,Category34,SKU238,Store_6,2021-03-31,625,2.04,1275.00,2021,3,13
1,Store_18_SKU329,Dept18,Category42,SKU329,Store_18,2021-03-31,209,26.73,5586.57,2021,3,13
2,Store_3_SKU76,Dept5,Category24,SKU76,Store_3,2021-03-31,2146,21.72,46611.12,2021,3,13
3,Store_16_SKU18,Dept17,Category70,SKU18,Store_16,2021-03-31,317,2.64,836.88,2021,3,13
4,Store_5_SKU719,Dept43,Category12,SKU719,Store_5,2021-03-31,97,23.82,2310.54,2021,3,13

In [38]:
processed_dataset_full_path = os.path.join(processed_dataset_path, processed_dataset_file)
df.to_csv(processed_dataset_full_path, index=False)
print(f"Processed dataset saved successfully as '{processed_dataset_file}' in {processed_dataset_path}.")

Processed dataset saved successfully as 'Processed_Capstone_Dataset_v1.0.csv' in ../dataset/processed/.

## EDA - Exploratory Data Analysis

In [40]:
df = pd.read_csv(processed_dataset_full_path)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71357 entries, 0 to 71356
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             71357 non-null  object
 1   DEPARTMENT     71357 non-null  object
 2   CATEGORY       71357 non-null  object
 3   SKU            71357 non-null  object
 4   Store          71357 non-null  object
 5   Week           71357 non-null  object
 6   Units_Sold     71357 non-null  int64
 7   Net_Price      71357 non-null  float64
 8   Total_Revenue  71357 non-null  float64
 9   Year           71357 non-null  int64
 10  Month          71357 non-null  int64
 11  Week_Number    71357 non-null  int64
dtypes: float64(2), int64(4), object(6)
memory usage: 6.5+ MB

In [43]:
df.head()

,ID,DEPARTMENT,CATEGORY,SKU,Store,Week,Units_Sold,Net_Price,Total_Revenue,Year,Month,Week_Number
0,Store_6_SKU238,Dept13,Category34,SKU238,Store_6,2021-03-31,625,2.04,1275.00,2021,3,13
1,Store_18_SKU329,Dept18,Category42,SKU329,Store_18,2021-03-31,209,26.73,5586.57,2021,3,13
2,Store_3_SKU76,Dept5,Category24,SKU76,Store_3,2021-03-31,2146,21.72,46611.12,2021,3,13
3,Store_16_SKU18,Dept17,Category70,SKU18,Store_16,2021-03-31,317,2.64,836.88,2021,3,13
4,Store_5_SKU719,Dept43,Category12,SKU719,Store_5,2021-03-31,97,23.82,2310.54,2021,3,13